controltheory/beamer/5/5_2_special.tex
% Created 2013-10-25 Fri 13:13
\documentclass[table]{beamer}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{amsmath}
\usepackage[usenames]{color}
\usepackage{pstricks}
\usepackage{pgfplots}
\pgfplotsset{compat=1.8}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\usepackage{beamerarticle}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
\setbeamercovered{transparent}
\subtitle{典型环节频率特性}
\providecommand{\alert}[1]{\textbf{#1}}

\title{线性系统的频域分析法}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}













\section{比例,积分微分环节}
\label{sec-1}
\begin{frame}
\frametitle{比例环节}
\label{sec-1-1}

\begin{eqnarray*}
G(s) & = & K\\
G(j\omega) & =& K\\
A(\omega) &=& K\\
\phi(\omega) &=& 0 \\
L(\omega)&=& 20\lg K
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{比例环节(续)  $G(j\omega) = K,K=1$}
\label{sec-1-2}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<1->{Nyquist图}
\label{sec-1-2-1}

\begin{tikzpicture}[scale=0.5]
%g=1;
\begin{axis}[
grid=both,
%axis x line=middle,axis y line= middle, 
ylabel=$j$ ,xlabel=$   $ ,
ymin=-1,ymax=1,xmin=0,xmax=2]
\fill[blue,thick] (axis cs:1,0)circle(0.1em) ;
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{Bode图}
\label{sec-1-2-2}

\begin{tikzpicture}[scale=0.5]
%g=1
\begin{semilogxaxis}[
grid=both,
%axis x line=below,axis y line= left, 
ylabel=$L(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
ymin=-20,ymax=20,xmin=0.1,xmax=10]
\draw[blue,thick] (axis cs:0.1,0)--(axis cs:10,0);
\end{semilogxaxis}
\end{tikzpicture}

\begin{tikzpicture}[scale=0.5]
%g=1
\begin{semilogxaxis}[
grid=both,
%axis x line=middle,axis y line= left, 
ylabel=$\phi(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
ymin=-50,ymax=30,xmin=0.1,xmax=10]
\draw[blue,thick] (axis cs:0.1,0)--(axis cs:10,0);
\end{semilogxaxis}
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{积分环节}
\label{sec-1-3}

\begin{eqnarray*}
G(s) & = & \frac{1}{s}\\
G(j\omega) & =& \frac{1}{j\omega}\\
A(\omega) &=& \frac{1}{\omega}\\
\phi(\omega) &=& -90^{\circ} \\
L(\omega)&=& -20\lg\omega
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{积分环节(续)$G(j\omega)  = \frac{1}{j\omega}$}
\label{sec-1-4}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<1->{Nyquist图}
\label{sec-1-4-1}

\begin{tikzpicture}[scale=0.5]
%g=1/s
\begin{axis}[
grid=both,
%axis x line=middle,axis y line= middle, 
ylabel=$j$ ,xlabel=$  $ ,
ymin=-1,ymax=0.5,xmin=-5,xmax=5,every axis plot post/.append style={mark=none}]
\addplot[blue,thick,->]
shell {
octave -q --eval "s=tf('s');g=1/s;[re,im]=nyquist(g);disp([re,im]);"
};
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{Bode图}
\label{sec-1-4-2}

\begin{tikzpicture}[scale=0.5]
%g=1/s
\begin{semilogxaxis}[
grid=both,
%axis x line=middle,axis y line= left, 
ylabel=$L(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
ymin=-20,ymax=23,xmin=0.1,xmax=10]
\addplot[blue,thick]
shell {
octave -q --eval "s=tf('s');g=1/s;w=[0.1 10]';[m,p,w]=bode(g,w);disp([w,20*log(m)/log(10)]);"
};
\end{semilogxaxis}
\end{tikzpicture}

\begin{tikzpicture}[scale=0.5]
%g=1/s
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$\phi(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=-100,ymax=0,xmin=0.1,xmax=10]
\draw[blue,thick] (axis cs:0.1,-90)--(axis cs:10,-90);
\end{semilogxaxis}
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{微分环节}
\label{sec-1-5}

\begin{eqnarray*}
G(s) & = & s\\
G(j\omega) & =& j\omega\\
A(\omega) &=& \omega\\
\phi(\omega) &=& 90^{\circ} \\
L(\omega)&=& 20\lg\omega
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{微分环节(续) $G(j\omega)  = j\omega$}
\label{sec-1-6}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<1->{Nyquist图}
\label{sec-1-6-1}

\begin{tikzpicture}[scale=0.5]
%g=s
\begin{axis}[
%axis x line=middle,axis y line= middle, 
ylabel=$j$ ,xlabel=$  $ ,
ymin=-0.5,ymax=1,xmin=-5,xmax=5,every axis plot post/.append style={mark=none},
grid=both]
\addplot[blue,thick,->]
shell {
octave -q --eval "s=tf('s');g=s;w=[0,9];[re,im]=nyquist(g,w);disp([re,im]);"
};
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{Bode图}
\label{sec-1-6-2}

\begin{tikzpicture}[scale=0.5]
%g=s
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$L(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=-20,ymax=23,xmin=0.1,xmax=10]
\addplot[blue,thick]
shell {
octave -q --eval "s=tf('s');g=s;w=[0.1 10]';[m,p,w]=bode(g,w);disp([w,20*log(m)/log(10)]);"
};
\end{semilogxaxis}
\end{tikzpicture}

\begin{tikzpicture}[scale=0.5]
%g=s
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$\phi(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=0,ymax=100,xmin=0.1,xmax=10]
\draw[blue,thick] (axis cs:0.1,90)--(axis cs:10,90);
\end{semilogxaxis}
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
