controltheory/beamer/5/5_2_special.tex
\section{惯性,一阶微分环节}
\label{sec-2}
\begin{frame}
\frametitle{惯性环节}
\label{sec-2-1}

\begin{eqnarray*}
G(s) & = & \frac{1}{Ts+1}\\
G(j\omega) & =& \frac{1}{j\omega T+1}\\
A(\omega) &=& \sqrt{\frac{1}{1+\omega^2 T^2}}\\
\phi(\omega) &=& -\arctan{\omega T} \\
L(\omega)&=& -20\lg\sqrt{1+\omega^2 T^2}\\
L_a(\omega)&=& \begin{cases} 0 & \omega<\frac{1}{T} \\  -20\lg\omega T & \omega>\frac{1}{T}\end{cases}
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{惯性环节(续) $G(j\omega) = \frac{1}{j\omega T+1},T=1$}
\label{sec-2-2}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<1->{Nyquist图}
\label{sec-2-2-1}

\begin{tikzpicture}[scale=0.5]
%g=1/(s+1)
\begin{axis}[
%axis x line=middle,axis y line= middle, 
ylabel=$j$ ,xlabel=$   $ ,
ymin=-0.5,ymax=0.1,xmin=-0.1,xmax=1.1,every axis plot post/.append style={mark=none},
grid=both]
\addplot[blue,thick,->]
shell {
octave -q --eval "s=tf('s');g=1/(s+1);[re,im]=nyquist(g);disp([re,im]);"
};
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{Bode图}
\label{sec-2-2-2}

\begin{tikzpicture}[scale=0.5]
%g=1/(s+1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$L(\omega)/L_a(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=-20,ymax=23,xmin=0.1,xmax=10]
\addplot[violet,thick]shell {octave -q --eval "s=tf('s');g=1/(1+s);[m,p,w]=bode(g);disp([w',20*log(m)/log(10)]);"};
\addlegendentry{$L(\omega)$}
\addplot[red,thick] shell {
octave -q --eval "k=1;b=0;a=[1];s=[0.01,1,10];
disp([s;20*log(k*prod(max(b' *s,1),1)./ prod(max(a'*s,1),1))/log(10)]');"
};
\addlegendentry{$L_a(\omega)$}
\end{semilogxaxis}
\end{tikzpicture}
\begin{tikzpicture}[scale=0.5]
%g=1/(s+1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$\phi(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=-100,ymax=10,xmin=0.01,xmax=10]
%\draw[blue,thick] (axis cs:0.1,90)--(axis cs:10,90);
\addplot[blue,thick]shell {octave -q --eval "s=tf('s');g=1/(1+s);[m,p,w]=bode(g);disp([w',p]);"};
\end{semilogxaxis}
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{一阶微分环节}
\label{sec-2-3}

\begin{eqnarray*}
G(s) & = & Ts+1\\
G(j\omega) & =& j\omega T+1\\
A(\omega) &=& \sqrt{1+\omega^2 T^2}\\
\phi(\omega) &=& \arctan{\omega T} \\
L(\omega)&=& 20\lg\sqrt{1+\omega^2 T^2}\\
L_a(\omega)&=& \begin{cases} 0 & \omega<\frac{1}{T} \\  20\lg\omega T & \omega>\frac{1}{T}\end{cases}
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{一阶微分环节(续) $G(j\omega) = j\omega T+1,T=1$}
\label{sec-2-4}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<1->{Nyquist图}
\label{sec-2-4-1}

\begin{tikzpicture}[scale=0.5]
%g=(s+1)
\begin{axis}[
%axis x line=middle,axis y line= middle, 
ylabel=$j$ ,xlabel=$   $ ,
ymin=-0.1,ymax=1,xmin=-0.1,xmax=1.1,every axis plot post/.append style={mark=none},
grid=both]
\addplot[blue,thick,->]
shell {
octave -q --eval "s=tf('s');g=(1+s);w=[0,1];[re,im]=nyquist(g,w);disp([re,im]);"
};
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{Bode图}
\label{sec-2-4-2}

\begin{tikzpicture}[scale=0.5]
%g=(s+1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
legend pos=south east,
ylabel=$L(\omega)/L_a(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=-20,ymax=23,xmin=0.1,xmax=10]
\addplot[violet,thick]shell {octave -q --eval "s=tf('s');g=1+s;[m,p,w]=bode(g);disp([w',20*log(m)/log(10)]);"};
\addlegendentry{$L(\omega)$}
\addplot[red,thick] shell {
octave -q --eval "k=1;a=0;b=[1];s=[0.01,1,10];
disp([s;20*log(k*prod(max(b' *s,1),1)./ prod(max(a'*s,1),1))/log(10)]');"
};
\addlegendentry{$L_a(\omega)$}
\end{semilogxaxis}
\end{tikzpicture}
\begin{tikzpicture}[scale=0.5]
%g=1/(s+1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$\phi(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=-10,ymax=100,xmin=0.01,xmax=10]
%\draw[blue,thick] (axis cs:0.1,90)--(axis cs:10,90);
\addplot[blue,thick]shell {octave -q --eval "s=tf('s');g=(1+s);[m,p,w]=bode(g);disp([w',p]);"};
\end{semilogxaxis}
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
\section{二阶环节}
\label{sec-3}
\begin{frame}
\frametitle{二阶振荡环节}
\label{sec-3-1}

\begin{eqnarray*}
G(s) & = & \frac{\omega_n^2}{\omega_n^2 +2\xi\omega_n s + s^2}
       =   \frac{1}{(Ts)^2+2\xi Ts+1} \\
G(j\omega) & =& \frac{1}{1+2j\xi\omega T-\omega^2 T^2}\\
A(\omega) &=& \sqrt{\frac{1}{(1-\omega^2 T^2)^2+(2\xi\omega T)^2}}\\
\phi(\omega) &=& 
\begin{cases}
-\arctan\frac{2\xi\omega T}{1-\omega^2 T^2} & \omega T <1 \\
-90^{\circ} & \omega T =1 \\
-180-\arctan\frac{2\xi\omega T}{1-\omega^2 T^2} & \omega T >1 
\end{cases} \\
L(\omega)&=& -20\lg\sqrt{(1-\omega^2 T^2)^2+(2\xi\omega T)^2}\\
L_a(\omega)&=& 
\begin{cases} 0 & \omega T<1 \\ 
-40\lg\omega T & \omega T>1
\end{cases}
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{二阶振荡环节(续)$G(j\omega) = \frac{1}{1+2j\xi\omega T-\omega^2 T^2}$}
\label{sec-3-2}

\begin{itemize}
\item Nyquist曲线与虚轴交点:
     \begin{eqnarray*}
     \Re[G(j\omega)] &=& 0\\
     1-\omega^2 T^2 &=& 0\\
     \omega T &=&1\\
     G(j\frac{1}{T})&=&-\frac{1}{2\xi}j
     \end{eqnarray*}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{二阶振荡环节(续)$G(j\omega) = \frac{1}{1+2j\xi\omega T-\omega^2 T^2}$}
\label{sec-3-3}

\begin{itemize}
\item 谐振频率与谐振峰值
     \begin{eqnarray*}
     A(\omega) &=& \sqrt{\frac{1}{(1-\omega^2 T^2)^2+(2\xi\omega T)^2}}\\
     \frac{dA(\omega)}{d\omega} &=& -\frac{-2(1-\omega^2 T^2)\omega T^2+4\xi^2\omega T^2}{\sqrt{(1-\omega^2 T^2)^2+(2\xi\omega T)^2}}
     \end{eqnarray*}
\begin{itemize}
\item <2-> 令 $\frac{dA(\omega)}{d\omega}=0$ ,得
\begin{itemize}
\item 谐振频率:$\omega_r=\omega_n\sqrt{1-2\xi^2}$ ,其中 $0<\xi\leq\frac{\sqrt{2}}{2}$
\item 谐振峰值:$M_r=\frac{1}{2\xi\sqrt{1-\xi^2}}$
\end{itemize}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{二阶振荡环节(续):$G(j\omega) = \frac{1}{1+2j\xi\omega T-\omega^2 T^2},T=1$}
\label{sec-3-4}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<1->{Nyquist图}
\label{sec-3-4-1}

\begin{tikzpicture}[scale=0.5]
%g=1/(T^2 s+2\xi Ts+1)
\begin{axis}[
%axis x line=middle,axis y line= middle, 
ylabel=$j$ ,xlabel=$   $ ,
legend pos=south east,
ymin=-1.5,ymax=0.1,xmin=-0.5,xmax=1.5,every axis plot post/.append style={mark=none},
grid=both]
\addplot[blue,thick,->]shell {
octave -q --eval "s=tf('s');x=0.5;g=1/(s^2+2*x*s+1);[re,im]=nyquist(g);disp([re,im]);" };
\addplot[green,thick,->]shell {
octave -q --eval "s=tf('s');x=0.7;g=1/(s^2+2*x*s+1);[re,im]=nyquist(g);disp([re,im]);" };
\addplot[red,thick,->]shell {
octave -q --eval "s=tf('s');x=1.3;g=1/(s^2+2*x*s+1);[re,im]=nyquist(g);disp([re,im]);" };
\legend{$\xi=0.5$ , $\xi=0.7$ , $\xi=1.3$}
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{Bode图}
\label{sec-3-4-2}

\begin{tikzpicture}[scale=0.5]
%g=1/(T^2 s+2\xi Ts+1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$L(\omega)/L_a(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
