controltheory/beamer/5/5_2_special.tex
legend pos=south west,
ymin=-45,ymax=10,xmin=0.1,xmax=10]
\addplot[pink,thick]shell {octave -q --eval "s=tf('s');x=0.5;g=1/(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',20*log(m)/log(10)]);"};
\addplot[green,thick]shell {octave -q --eval "s=tf('s');x=0.7;g=1/(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',20*log(m)/log(10)]);"};
\addplot[blue,thick]shell {octave -q --eval "s=tf('s');x=1.3;g=1/(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',20*log(m)/log(10)]);"};
\addplot[red,thick] shell {
octave -q --eval "k=1;b=0;a=[1 1];s=[0.01,1,10];
disp([s;20*log(k*prod(max(b' *s,1),1)./ prod(max(a'*s,1),1))/log(10)]');"
};
\legend{$\xi=0.5$ , $\xi=0.7$ , $\xi=1.3$ , $L_a(\omega)$}
\end{semilogxaxis}
\end{tikzpicture}
\begin{tikzpicture}[scale=0.5]
%g=1/(T^2 s+2\xi Ts+1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$\phi(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
legend pos=south west,
ymin=-180,ymax=10,xmin=0.01,xmax=10]
%\draw[blue,thick] (axis cs:0.1,90)--(axis cs:10,90);
\addplot[pink,thick]shell {octave -q --eval "s=tf('s');x=0.5;g=1/(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',p]);"};
\addplot[green,thick]shell {octave -q --eval "s=tf('s');x=0.7;g=1/(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',p]);"};
\addplot[blue,thick]shell {octave -q --eval "s=tf('s');x=1.3;g=1/(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',p]);"};
\legend{$\xi=0.5$ , $\xi=0.7$ , $\xi=1.3$}
\end{semilogxaxis}
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{二阶微分环节}
\label{sec-3-5}

\begin{eqnarray*}
G(s) & = & (Ts)^2+2\xi Ts+1 \\
G(j\omega) & =& 1+2j\xi\omega T-\omega^2 T^2\\
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{二阶微分环节(续)$G(j\omega) = 1+2j\xi\omega T-\omega^2 T^2,T=1$}
\label{sec-3-6}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<1->{Nyquist图}
\label{sec-3-6-1}

\begin{tikzpicture}[scale=0.5]
%g=(T^2 s+2\xi Ts+1)
\begin{axis}[
%axis x line=middle,axis y line= middle, 
ylabel=$j$ ,xlabel=$   $ ,
legend pos=north east,
ymin=0,ymax=5,xmin=-1,xmax=1.5,every axis plot post/.append style={mark=none},
grid=both]
\addplot[blue,thick,->]shell {
octave -q --eval "s=tf('s');x=0.5;g=(s^2+2*x*s+1);w=logspace(-10,0.1,100);[re,im]=nyquist(g,w);disp([re,im]);" };
\addplot[green,thick,->]shell {
octave -q --eval "s=tf('s');x=0.7;g=(s^2+2*x*s+1);w=logspace(-10,0.1,100);[re,im]=nyquist(g,w);disp([re,im]);" };
\addplot[red,thick,->]shell {
octave -q --eval "s=tf('s');x=1.3;g=(s^2+2*x*s+1);w=logspace(-10,0.1,100);[re,im]=nyquist(g,w);disp([re,im]);" };
\legend{$\xi=0.5$ , $\xi=0.7$ , $\xi=1.3$}
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{Bode图}
\label{sec-3-6-2}

\begin{tikzpicture}[scale=0.5]
%g=T^2 s+2\xi Ts+1
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$L(\omega)/L_a(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
legend pos=north west,
ymin=-10,ymax=45,xmin=0.1,xmax=10]
\addplot[pink,thick]shell {octave -q --eval "s=tf('s');x=0.5;g=(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',20*log(m)/log(10)]);"};
\addplot[green,thick]shell {octave -q --eval "s=tf('s');x=0.7;g=(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',20*log(m)/log(10)]);"};
\addplot[blue,thick]shell {octave -q --eval "s=tf('s');x=1.3;g=(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',20*log(m)/log(10)]);"};
\addplot[red,thick] shell {
octave -q --eval "k=1;a=0;b=[1 1];s=[0.01,1,10];
disp([s;20*log(k*prod(max(b' *s,1),1)./ prod(max(a'*s,1),1))/log(10)]');"
};
\legend{$\xi=0.5$ , $\xi=0.7$ , $\xi=1.3$ , $L_a(\omega)$}
\end{semilogxaxis}
\end{tikzpicture}
\begin{tikzpicture}[scale=0.5]
%g=(T^2 s+2\xi Ts+1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$\phi(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
legend pos=north west,
ymin=-10,ymax=180,xmin=0.01,xmax=10]
%\draw[blue,thick] (axis cs:0.1,90)--(axis cs:10,90);
\addplot[pink,thick]shell {octave -q --eval "s=tf('s');x=0.5;g=(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',p]);"};
\addplot[green,thick]shell {octave -q --eval "s=tf('s');x=0.7;g=(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',p]);"};
\addplot[blue,thick]shell {octave -q --eval "s=tf('s');x=1.3;g=(1+2*x*s+s^2);[m,p,w]=bode(g);disp([w',p]);"};
\legend{$\xi=0.5$ , $\xi=0.7$ , $\xi=1.3$}
\end{semilogxaxis}
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
\section{非最小相位环节}
\label{sec-4}
\begin{frame}
\frametitle{延迟环节}
\label{sec-4-1}

\begin{eqnarray*}
G(s) & = & e^{-\tau s}\\
G(j\omega) & =& e^{-j\omega\tau} \\
A(\omega) &=& 1\\
\phi(\omega) &=& -\omega\tau 
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{延迟环节(续)$G(j\omega)  = e^{-j\omega\tau},\tau=1$}
\label{sec-4-2}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<1->{Nyquist图}
\label{sec-4-2-1}

\begin{tikzpicture}[scale=0.5]
%g=e^{-\tau s};
\begin{axis}[
grid=both,
%axis x line=middle,axis y line= middle, 
ylabel=$j$ ,xlabel=$   $ ,
ymin=-1.1,ymax=1.1,xmin=-1.1,xmax=1.1]
\addplot[blue,thick,->]shell {octave -q --eval "t=linspace(0,-2*pi,50)';disp([cos(t),sin(t)]);"};
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{Bode图}
\label{sec-4-2-2}

\begin{tikzpicture}[scale=0.5]
%g=e^{-\tau s};
\begin{semilogxaxis}[
grid=both,
%axis x line=middle,axis y line= left, 
ylabel=$L(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
ymin=-20,ymax=20,xmin=0.1,xmax=10]
\draw[blue,thick] (axis cs:0.1,0)--(axis cs:10,0);
\end{semilogxaxis}
\end{tikzpicture}
\begin{tikzpicture}[scale=0.5]
%g=e^{-\tau s};
\begin{semilogxaxis}[
grid=both,
%axis x line=middle,axis y line= left, 
ylabel=$\phi(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
ymin=-100,ymax=0,xmin=0.1,xmax=10]
\addplot[blue,thick,->]shell {octave -q --eval "t=logspace(-1,0.2,10)';disp([t,-180/pi*t]);"};
\end{semilogxaxis}
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{非最小相位惯性环节}
\label{sec-4-3}

最小相位系统:在右半平面无零极点
\begin{eqnarray*}
G(s) & = & \frac{1}{Ts-1}\\
G(j\omega) & =& \frac{1}{j\omega T-1}\\
A(\omega) &=& \sqrt{\frac{1}{1+\omega^2 T^2}}\\
\phi(\omega) &=& -180^{\circ}+\arctan{\omega T} \\
L(\omega)&=& -20\lg\sqrt{1+\omega^2 T^2}\\
L_a(\omega)&=& \begin{cases} 0 & \omega<\frac{1}{T} \\  -20\lg\omega T & \omega>\frac{1}{T}\end{cases}
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{非最小相位惯性环节(续)$G(j\omega) = \frac{1}{j\omega T-1},T=1$}
\label{sec-4-4}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<1->{Nyquist图}
\label{sec-4-4-1}

\begin{tikzpicture}[scale=0.5]
%g=1/(s-1)
\begin{axis}[
%axis x line=middle,axis y line= middle, 
ylabel=$j$ ,xlabel=$   $ ,
ymin=-0.5,ymax=0.1,xmin=-1.1,xmax=0.1,every axis plot post/.append style={mark=none},
grid=both]
\addplot[blue,thick,->]
shell {
octave -q --eval "s=tf('s');g=1/(s-1);[re,im]=nyquist(g);disp([re,im]);"
};
\end{axis}
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{Bode图}
\label{sec-4-4-2}

\begin{tikzpicture}[scale=0.5]
%g=1/(s-1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$L(\omega)/L_a(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=-20,ymax=23,xmin=0.1,xmax=10]
\addplot[violet,thick]shell {octave -q --eval "s=tf('s');g=1/(-1+s);[m,p,w]=bode(g);disp([w',20*log(m)/log(10)]);"};
\addlegendentry{$L(\omega)$}
\addplot[red,thick] shell {
octave -q --eval "k=1;b=0;a=[1];s=[0.01,1,10];
disp([s;20*log(k*prod(max(b' *s,1),1)./ prod(max(a'*s,1),1))/log(10)]');"
};
\addlegendentry{$L_a(\omega)$}
\end{semilogxaxis}
\end{tikzpicture}

\begin{tikzpicture}[scale=0.5]
%g=1/(s-1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$\phi(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
