controltheory/beamer/5/5_2_special.org
*** Bode图						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :BEAMER_envargs: <2->
     :END:
\begin{tikzpicture}[scale=0.5]
%g=1/(s-1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$L(\omega)/L_a(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=-20,ymax=23,xmin=0.1,xmax=10]
\addplot[violet,thick]shell {octave -q --eval "s=tf('s');g=1/(-1+s);[m,p,w]=bode(g);disp([w',20*log(m)/log(10)]);"};
\addlegendentry{$L(\omega)$}
\addplot[red,thick] shell {
octave -q --eval "k=1;b=0;a=[1];s=[0.01,1,10];
disp([s;20*log(k*prod(max(b' *s,1),1)./ prod(max(a'*s,1),1))/log(10)]');"
};
\addlegendentry{$L_a(\omega)$}
\end{semilogxaxis}
\end{tikzpicture}

\begin{tikzpicture}[scale=0.5]
%g=1/(s-1)
\begin{semilogxaxis}[
%axis x line=middle,axis y line= left, 
ylabel=$\phi(\omega)$ ,xlabel=$\omega$ ,
every axis plot post/.append style={mark=none},
grid=both,
ymin=-180,ymax=-90,xmin=0.01,xmax=10]
%\draw[blue,thick] (axis cs:0.1,90)--(axis cs:10,90);
\addplot[blue,thick]shell {octave -q --eval "s=tf('s');g=1/(-1+s);[m,p,w]=bode(g);disp([w',p]);"};
\end{semilogxaxis}
\end{tikzpicture}

