controltheory/beamer/5/5_2_special.tex
ymin=-180,ymax=-90,xmin=0.01,xmax=10]
%\draw[blue,thick] (axis cs:0.1,90)--(axis cs:10,90);
\addplot[blue,thick]shell {octave -q --eval "s=tf('s');g=1/(-1+s);[m,p,w]=bode(g);disp([w',p]);"};
\end{semilogxaxis}
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}

\end{document}
